# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rake db:seed (or created alongside the db with db:setup).
#
# Examples:
#
#   cities = City.create([{ name: 'Chicago' }, { name: 'Copenhagen' }])
#   Mayor.create(name: 'Emanuel', city: cities.first)
desc_auth=[]
desc_auth << "Эрик Берн – знаменитый американский психолог и психиатр. Берн разработал трансакционный анализ и сценарный анализ.
              Рассматривая идеи психоанализа, а также общей теории и метода лечения нервных и психических заболеваний, Эрик Берн
              основное внимание уделял 'трансакциям'', которые составляют основу межличностных отношений. Те виды трансакций,
              которые имеют в себе скрытую цель, он назвал играми. Берн выделяет три эго-состояния: Ребенок, Взрослый, Родитель
              (при этом он не отождествляет их с классификацией Фрейда Я, Сверх-Я и Оно). Берн считает, что во время контакта с
              окружающей средой, человек обязательно находится в одном из трех этих состояний.
              Эрик Берн (настоящее имя Леонард Бернштейн) родился 10 мая 1910 в Монреале (провинция Квебек, Канада). Отец
              Эрика работал врачом, а мать – редактор. Семья иммигрировала в Канаду из Польши и России. Родители Эрика окончили
              университет Макгилл (самый известный канадский университет, входит в ТОП-20 университетов мира), который успешно
              окончил и Эрик. В период с 1936 по 1938 год Берн посещает курсы при психиатрической клинике в Йельском университете.
              Затем он изучает психоанализ в Нью-йоркском и Сан-францисском институтах психоанализа. В 1943 году он принимает
              американское гражданство. Три года Берн служил в качестве врача-психиатра в армии Соединенных Штатов. После
              этого он работал адъюнкт-психиатром в Больнице Горы Сион в Сан-Франциско и занимался частной практикой. А в начале
              шестидесятых годов начинает вести популярные семинары по групповой терапии. Основываясь на результатах этих семинаров,
              он пишет книгу - 'Игры, в которые играют люди', которая стала мировым бестселлером."

desc_auth << "Бьерне Страуструп (Bjarne Stroustrup) — всемирно известный датский программист. Автор языка программирования C++.
              Страуструп принимал непосредственное участие в разработке стандарта ANSI/ISO для языка C++ . В настоящее время
              он занимается поддержанием и обновлением стандарта. С++ один из наиболее широко используемым языков. Поддерживает
              объектно-ориентированное программирование. Бьярн Страуструп окончил университет в Орхусе по специальности математика
              и информатика, диссертацию по информатике защитил в 1979 году в знаменитом Кембриджском университете (Великобритания).
              Работал в Кэмбридже над конструированием распределенной системы. Руководил отделом по исследованию в компании AT&T
              и занимался крупномасштабным программированием В настоящее время - профессор университета А&М в Техасе.
              Бьярн Страуструп – автор пяти замечательных книг по программированию, автор множества научных и популярных статей.
              Книга Бьерне Страуструпа 'Справочное руководство по языку программирования С++ с комментариями' была награждена
              за непревзойденное мастерство в области технической документации. 'Язык программирования C++' стала настольной
              книгой для многих программистов, переведена на многие иностранные языки. 'Дизайн и эволюция C++' содержит множество
              интересных деталей в описание языков программирования и была награждена Productivity Award за помощь программистам в
              совершенствовании их исходных кодов."

desc_auth << "Стив Макконнелл (Steven C. McConnell) — известный американский американски программист. Автор популярных книг по
              разработке программного обеспечения для компьютеров. За свои книги он дважды получал премию журнала Software Development
              Jolt Excellence (в номинации лучшие книги года о разработке программного обеспечения). Макконнелл считается одним из трех
              самых влиятельных людей в области разработки программного обеспечения. Его имя стоит в одном ряду с именами Билла Гейтса и
              Линуса Торвальдса. Автор книг Rapid Development (1996), Software Project Survival Guide (1998), Professional Software Development (2004).
              Самая знаменитая книга Макконнелла, 'Совершенный код' содержит необходимый для реальной практики материал, рассматривает
              исключительно грамотные принципы разработки программного обеспечения, основанные на наиболее эффективных методиках и принципах.
              Дается точное прагматичное руководство. Именно Стиву Макконнеллу принадлежит известная фраза: 'Код нужно писать так, как будто его будет
              сопровождать склонный к насилию психически неуравновешенный тип, который догадывается где вы живете'. "

desc_auth << "Роберт К. Мартин (Robert C. Martin) - основатель, исполнительный директор и президент компании Object Mentor Incorporated
              (дочерняя компания Object Mentor International). Компания предоставляет консультационные услуги в области объектно-ориентированного
              программного, консалтинг и обучение для крупных корпораций по всему миру. Роберт Мартин - профессиональный программист.
              Он принимал участие нескольких десятках программных проектов. Мартин автор знаковых книг по программированию Agile,
              Экстремальное программирование, UML, объектно-ориентированное программирование и C + +. Его статьи печатают многие компьютерные
              журналы мира. Мартин - ведущий специалист индустрии программного обеспечения, принимает участие в международных конференциях и выставках.
              Он долгое время работал редактором журнала 'C + + Report' и в настоящее время ведет профессиональную колонку в этом журнале.
              Книги Роберта Мартина купить можно в нашем интернет-магазине."

desc_auth << "Лайза Смит Арнольд - иллюстратор и художник. Закончила Сиракузский университет, получив там степень бакалавра изящных искусств,
              после чего сразу же направилась в Нью-Йорк. Там она работала в Conde Nast Publications и других компаниях, представляющих мир моды.
              В результате в большинстве ее художественных работ по-прежнему заметно сильное влияние мира моды. В настоящее время Лайза проживает
              с мужем и тремя детьми в г. Уэстпорт, шт. Коннектикут."

desc_auth << "Марианна Иган. Детские годы Марианны Иган прошли неподалеку от Чикаго, а степень бакалавра искусств по специальности 'модельер'
              она получила в Международной академии дизайна и технологий (International Academy of Design & Technology) в Чикаго.
              Она также получила ученую степень магистра по специальности “конструирование одежды” в университете шт. Орегон, где занималась в
              основном конструированием и иллюстрированием высокой моды (-от-кутюр ). В свое время Марианна поработала дизайнером и иллюстратором-фрилансером,
              а сейчас преподает художественное моделирование, компьютерный дизайн, а также пошив корсетов и женского платья без бретелек в университете
              шт. Орегон. Кроме того, она ведет небольшой собственный бизнес (организация и проведение свадебных церемоний); ее сайт вы можете посетить по
              адресу http://www.marianneegan.com. Когда Марианна не занимается своим сыном, она посвящает свое время таким занятиям, как танец живота,
              оздоровительный бег трусцой, рисование и работа за швейной машинкой."

desc_auth << "Даниэль Канеман. Израильско-американский психолог, один из основоположников психологической экономической теории и поведенческих финансов,
              в которых объединены экономика и когнитивистика для объяснения иррациональности отношения человека к риску в принятии решений и в управлении своим поведением.
              Знаменит своей работой, выполненной совместно с Амосом Тверски и другими авторами, по установлению когнитивной основы для общих человеческих заблуждений
              в использовании эвристик, а также для развития теории перспектив; лауреат Нобелевской премии по экономике 2002 года «за применение психологической методики
              в экономической науке, в особенности — при исследовании формирования суждений и принятия решений в условиях неопределённости» (совместно с В. Смитом),
              несмотря на то, что исследования проводил как психолог, а не как экономист."

desc_auth << "Джефф Сазерленд — советник венчурного фонда OpenView Venture Partners, глава компании Scrum, Inc. и автор методики Scrum, которую он описывает в своей книге.
              Он разработал методику в 1993 году и формализовал её в 1995 вместе с Кеном Швабером. Методология Джеффа использовалась и используется компаниями-разработчиками
              программного обеспечениями по всему миру. Но Джефф понял, что Scrum может приносить пользу не только ИТ-компаниям, и адаптировал её для других отраслей — финансов,
              здравоохранения, высшего образования, телекоммуникаций. Он консультирует множество компаний, помогая им создавать сверхпродуктивные команды.
              Джефф работал на позиции технического директора в одиннадцати технологичных компаниях."

desc_auth << "Джош Кауфман— автор международного бестселлера The Personal MBA («Сам себе МВА»), основатель и руководитель одноименного интернет-проекта
              PersonalMBA.com. Начиная с 2005 года его сайт посетили более 1,6 млн человек.
              Кауфман разработал уникальный междисциплинарный подход, который помог миллионам специалистов из самых разных отраслей познакомиться с основами
              предпринимательства, маркетинга, продаж, финансового менеджмента, проектирования систем и личностной психологии.
              Его программа позволяет получить все необходимые для решения бизнес-задач знания самостоятельно,
              не тратя денег на дорогостоящее обучение в бизнес-школах."

desc_auth << "Джереми Блум. Профессиональный инженер-электронщик, известный во всем мире благодаря серии популярных образовательных"+
             "видеоуроков по Arduino, размещенных на YouTube, а также оригинальным разработкам: системы отслеживания для «умных» солнечных батарей,"+
             " протеза руки, ходячих роботов, музыкального терменвокса, контроллеров жеста на перчатках, «машинного зрения» и многого другого."

lorem_ipsum = 'Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut'+
              'labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris'+
              'nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit'+
              'esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt'+
              'in culpa qui officia deserunt mollit anim id est laborum.'

Genre.delete_all
Author.delete_all
Book.delete_all
Cart.delete_all
Order.delete_all
User.delete_all

genres = Genre.create([{name: 'Разное'},{name: 'Художественная'},{name: 'Медицина и здоровье'},{name: 'Гуманитарные науки'},
                       {name: 'Естественные науки'},{name: 'Юридическая'},{name: 'Психология'},
                       {name: 'Хобби и увлечения'},{name: 'Техника и технологии'},{name: 'Радиоэлектроника'},
                       {name: 'Дизайн'},{name: 'Экономическая'},{name: 'Компьютерная литература'}])

authors = Author.create([{name: 'Эрик Берн', description: desc_auth[0]},
                         {name: 'Бьерне Страуструп', description: desc_auth[1]},
                         {name: 'Стив Макконнелл', description: desc_auth[2]},
                         {name: 'Роберт К. Мартин', description: desc_auth[3]},
                         {name: 'Лайза Смит Арнольд', description: desc_auth[4]},
                         {name: 'Марианна Иган', description: desc_auth[5]},
                         {name: 'Даниэль Канеман', description: desc_auth[6]},
                         {name: 'Джефф Сазерленд', description: desc_auth[7]},
                         {name: 'Джош Кауфман', description: desc_auth[8]},
                         {name: 'Джереми Блум', description: desc_auth[9]}
                        ])
books=[]
 99.times do |number|
   isbn_part=rand(11111..12000)
   books<< Book.create([{name: 'BookName '+number.to_s,
              price: rand(2.50..29.99),
              quantity: rand(0..20),
              sold: rand(0..20),
              year: rand(1950..2016),
              isbn: '978-596-'+isbn_part.to_s+'-5',
              description:lorem_ipsum,
              genre: genres[rand(genres.count)]}]) end

books=Book.all
books.each do |b|
  a1=authors[rand(authors.count)]
  a2=authors[rand(authors.count)]
  b.authors << a1
  b.authors << a2
end

users = User.create([{email: 'admin@admin.ua',
                      admin: true,
                      login:'admin',
                      password:'password',
                      password_confirmation:'password'},
                     {email: 'user1@us.ua',
                      login:'user1',
                      name:'Name Surname',
                      address:'Some Address1 street',
                      password:'password',
                      password_confirmation:'password'},
                      {email: 'user2@us.ua',
                          login:'user2',
                       name:'Name Surname2',
                       address:'Some Address2 street',
                       password:'password',
                       password_confirmation:'password'}])